test/tests/timesteppers/foam_controlled_tstep_cfl_insert/buoyantCavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    topAndBottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
    hot
    {
        type            fixedValue;
        value           uniform 307.75;
    }
    cold
    {
        type            fixedValue;
        value           uniform 288.15;
    }
}


// ************************************************************************* //
